JK1DVP/dvplogger/dvplogger/main/esp32_flasher.c
/*
 * dvplogger - field companion for ham radio operator
 * dvplogger - アマチュア無線家のためのフィールド支援ツール
 * Copyright (c) 2021-2026 Eiichiro Araki
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include <Arduino.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <inttypes.h>
#include <sys/param.h>
#include <assert.h>

#include <string.h>
#include "esp_err.h"
#include "esp_system.h"
#include "esp_log.h"
#include "driver/uart.h"
#include "driver/gpio.h"
#include "esp_loader_io.h"
#include "esp_loader.h"
#include "esp32_port.h"
#include "example_common.h"


//#include <SD.h>
//#include "esp_vfs_fat.h"
//#include "driver/sdspi_host.h"
//#include "sdmmc_cmd.h"


// required in partition based flashing ?
#include "esp_flash.h"
#include "esp_partition.h"
//#include <stdio.h>

#include "mcp_interface.h"
#include "esp32_flasher.h"

//#include <SoftwareSerial.h>
//#include "decl.h"
#include "sd_wrapper.h"

/* Route flasher progress to the same runtime console Stream as commands. */
#define printf(...) dvplogger_console_printf(__VA_ARGS__)
//extern SoftwareSerial Serial3;
//extern SoftwareSerial Serial4;

static const char *TAG = "serial_flasher";

extern const uint8_t  bootloader_bootloader_bin[];
extern const uint32_t bootloader_bootloader_bin_size;
extern const uint8_t  bootloader_bootloader_bin_md5[];
extern const uint8_t  jk1dvplog_ext_bin[];
extern const uint32_t jk1dvplog_ext_bin_size;
extern const uint8_t  jk1dvplog_ext_bin_md5[];
extern const uint8_t  partition_table_partition_table_bin[];
extern const uint32_t partition_table_partition_table_bin_size;
extern const uint8_t  partition_table_partition_table_bin_md5[];
const uint8_t gpio0_trigger_mcp_pin = 14;
const uint8_t reset_trigger_mcp_pin = 15;
// For esp32, esp32s2
#define BOOTLOADER_ADDRESS_V0       0x1000
// For esp8266, esp32s3 and later chips
#define BOOTLOADER_ADDRESS_V1       0x0
// For esp32c5
#define BOOTLOADER_ADDRESS_V2       0x2000
#define PARTITION_ADDRESS           0x8000
#define APPLICATION_ADDRESS         0x10000
#define SPIFFS_ADDRESS              0x190000

#define HIGHER_BAUDRATE 230400

// Max line size
#define BUF_LEN 128
static uint8_t buf[BUF_LEN] = {0};

static const char *get_error_string(const esp_loader_error_t error);

void slave_monitor(void *arg)
{
#if (HIGHER_BAUDRATE != 115200)
    uart_flush_input(UART_NUM_2);
    uart_flush(UART_NUM_2);
    uart_set_baudrate(UART_NUM_2, 115200);
#endif
    while (1) {
        int rxBytes = uart_read_bytes(UART_NUM_2, buf, BUF_LEN, 100 / portTICK_PERIOD_MS);
        buf[rxBytes] = '\0';
        printf("%s", buf);
    }
}

void loader_boot_init_func() {
  printf("[FLASHERSD] boot init: MCP pin %u -> HIGH/output\n", gpio0_trigger_mcp_pin);
  mcp_write_pin(gpio0_trigger_mcp_pin,1);
  mcp_pin_mode(gpio0_trigger_mcp_pin,OUTPUT);
}

void loader_reset_init_func() {
  printf("[FLASHERSD] reset init: MCP pin %u -> HIGH/output\n", reset_trigger_mcp_pin);
  mcp_write_pin(reset_trigger_mcp_pin,1);
  mcp_pin_mode(reset_trigger_mcp_pin,OUTPUT);
}

void loader_port_reset_target_func() {
  printf("[FLASHERSD] reset target: MCP pin %u LOW hold=%u ms\n",
         reset_trigger_mcp_pin, (unsigned int)SERIAL_FLASHER_RESET_HOLD_TIME_MS);
  mcp_write_pin(reset_trigger_mcp_pin, 0);
  loader_port_delay_ms(SERIAL_FLASHER_RESET_HOLD_TIME_MS);
  mcp_write_pin(reset_trigger_mcp_pin, 1);
  printf("[FLASHERSD] reset target: MCP pin %u HIGH\n", reset_trigger_mcp_pin);
}

void loader_port_enter_bootloader_func() {
  printf("[FLASHERSD] enter bootloader: MCP GPIO0 pin %u LOW\n",
         gpio0_trigger_mcp_pin);
  mcp_write_pin(gpio0_trigger_mcp_pin,0);
  loader_port_reset_target_func();
  printf("[FLASHERSD] boot hold=%u ms\n",
         (unsigned int)SERIAL_FLASHER_BOOT_HOLD_TIME_MS);
  loader_port_delay_ms(SERIAL_FLASHER_BOOT_HOLD_TIME_MS);
  mcp_write_pin(gpio0_trigger_mcp_pin,1);
  printf("[FLASHERSD] enter bootloader: MCP GPIO0 pin %u HIGH\n",
         gpio0_trigger_mcp_pin);
}



void esp_flasher_sd(char *which)
{
  printf("[FLASHERSD] ENTRY before config hwver=%d stack_hwm=%u free_heap=%u\n",
         JK1DVPLOG_HWVER,
         (unsigned int)uxTaskGetStackHighWaterMark(NULL),
         (unsigned int)esp_get_free_heap_size());
  fflush(stdout);

  printf("[FLASHERSD] sizeof(loader_esp32_config_t)=%u\n",
         (unsigned int)sizeof(loader_esp32_config_t));
  fflush(stdout);

  const loader_esp32_config_t config = {
    .baud_rate = 115200,
    .uart_port = UART_NUM_2,
    .uart_rx_pin = GPIO_NUM_34,
    .uart_tx_pin = GPIO_NUM_4,
    .reset_trigger_pin = GPIO_NUM_15,
    .gpio0_trigger_pin = GPIO_NUM_27,
    .loader_boot_init_func=loader_boot_init_func, // target boot pin initialization function or NULL
    .loader_reset_init_func=loader_reset_init_func, // target reset pin initialization function or NULL
    .loader_port_reset_target_func=loader_port_reset_target_func, // target reset function or NULL
    .loader_port_enter_bootloader_func=loader_port_enter_bootloader_func // target enter bootloader function or NULL
  };

  printf("[FLASHERSD] config constructed stack_hwm=%u free_heap=%u\n",
         (unsigned int)uxTaskGetStackHighWaterMark(NULL),
         (unsigned int)esp_get_free_heap_size());
  fflush(stdout);

  printf("[FLASHERSD] begin which='%s' hwver=%d\n",
         which ? which : "(null)", JK1DVPLOG_HWVER);
  printf("[FLASHERSD] config uart=%d rx=%d tx=%d initial_baud=%d higher_baud=%d\n",
         (int)config.uart_port, (int)config.uart_rx_pin, (int)config.uart_tx_pin,
         (int)config.baud_rate, (int)HIGHER_BAUDRATE);
  printf("[FLASHERSD] MCP gpio0=%u reset=%u uart2_driver_before=%d\n",
         gpio0_trigger_mcp_pin, reset_trigger_mcp_pin,
         uart_is_driver_installed(UART_NUM_2) ? 1 : 0);
  fflush(stdout);

