JK1DVP/dvplogger/dvplogger/main/esp32_flasher.c
  printf("[FLASHERSD] BEFORE loader_port_esp32_init stack_hwm=%u\n",
         (unsigned int)uxTaskGetStackHighWaterMark(NULL));
  fflush(stdout);

  //  setup_vfs_sd();
  esp_loader_error_t init_err = loader_port_esp32_init(&config);
  printf("[FLASHERSD] loader_port_esp32_init result=%d (%s) uart2_driver_after=%d\n",
         (int)init_err, get_error_string(init_err),
         uart_is_driver_installed(UART_NUM_2) ? 1 : 0);
  if (init_err != ESP_LOADER_SUCCESS) { // replace this with custom version using mcp
    ESP_LOGE(TAG, "serial initialization failed.");
    return;
  }

  printf("[FLASHERSD] connect_to_target begin\n");
  esp_loader_error_t connect_err = connect_to_target(HIGHER_BAUDRATE);
  printf("[FLASHERSD] connect_to_target result=%d (%s)\n",
         (int)connect_err, get_error_string(connect_err));
  if (connect_err == ESP_LOADER_SUCCESS) {
    if (strstr(which,"boot")!=NULL) {
      ESP_LOGI(TAG, "Loading bootloader...");
      int rc = flash_bin_file_streaming("/bootload.bin",BOOTLOADER_ADDRESS_V0);
      printf("[FLASHERSD] boot result=%d\n", rc);
    }
    if (strstr(which,"part") != NULL) {
      ESP_LOGI(TAG, "Loading partition table...");
      int rc = flash_bin_file_streaming("/partitio.bin",PARTITION_ADDRESS);
      printf("[FLASHERSD] partition result=%d\n", rc);
    }
    if (strstr(which,"app")!=NULL) {
      ESP_LOGI(TAG, "Loading app...");
      int rc = flash_bin_file_streaming("/app0.bin",APPLICATION_ADDRESS);
      printf("[FLASHERSD] app result=%d\n", rc);
    }
    if (strstr(which,"spiffs")!= NULL) {
      ESP_LOGI(TAG, "Loading SPIFFS...");
      int rc = flash_bin_file_streaming("/spiffs.bin",SPIFFS_ADDRESS);
      printf("[FLASHERSD] spiffs result=%d\n", rc);
    }
    ESP_LOGI(TAG, "Done!");
    printf("[FLASHERSD] esp_loader_reset_target begin\n");
    esp_loader_reset_target();
    printf("[FLASHERSD] esp_loader_reset_target returned\n");

    // Delay for skipping the boot message of the targets
    vTaskDelay(500 / portTICK_PERIOD_MS);
  } else {
    printf("[FLASHERSD] abort: target connection failed\n");
  }
  printf("[FLASHERSD] end uart2_driver=%d free_heap=%u\n",
         uart_is_driver_installed(UART_NUM_2) ? 1 : 0,
         (unsigned int)esp_get_free_heap_size());
  //  unmount_sdcard_vfs();
}

void esp_flasher(void)
{
    example_binaries_t bin;
    printf("esp_flasher() in\n");
    const loader_esp32_config_t config = {
        .baud_rate = 115200,
        .uart_port = UART_NUM_2,
        .uart_rx_pin = GPIO_NUM_34,
        .uart_tx_pin = GPIO_NUM_4,
        .reset_trigger_pin = GPIO_NUM_15,
        .gpio0_trigger_pin = GPIO_NUM_27,
	.loader_boot_init_func=loader_boot_init_func, // target boot pin initialization function or NULL
	.loader_reset_init_func=loader_reset_init_func, // target reset pin initialization function or NULL
	.loader_port_reset_target_func=loader_port_reset_target_func, // target reset function or NULL
	.loader_port_enter_bootloader_func=loader_port_enter_bootloader_func // target enter bootloader function or NULL
    };
    printf("esp_flasher() 1\n");
    
    if (loader_port_esp32_init(&config) != ESP_LOADER_SUCCESS) { // replace this with custom version using mcp 
        ESP_LOGE(TAG, "serial initialization failed.");
        return;
    }
    printf("esp_flasher() 2\n");
    if (connect_to_target(HIGHER_BAUDRATE) == ESP_LOADER_SUCCESS) {

      //      get_example_binaries(esp_loader_get_target(), &bin);
        bin.boot.data = bootloader_bootloader_bin;
        bin.boot.size = bootloader_bootloader_bin_size;
        bin.boot.md5 = bootloader_bootloader_bin_md5;
        bin.boot.addr = BOOTLOADER_ADDRESS_V0;
        bin.part.data = partition_table_partition_table_bin;
        bin.part.size = partition_table_partition_table_bin_size;
        bin.part.md5 = partition_table_partition_table_bin_md5;
        bin.part.addr = PARTITION_ADDRESS;
        bin.app.data  = jk1dvplog_ext_bin;
        bin.app.size  = jk1dvplog_ext_bin_size;
        bin.app.md5 = jk1dvplog_ext_bin_md5;
        bin.app.addr  = APPLICATION_ADDRESS;
      
	printf("esp_flasher() 3\n");
        ESP_LOGI(TAG, "Loading bootloader...");
        flash_binary(bin.boot.data, bin.boot.size, bin.boot.addr);
        ESP_LOGI(TAG, "Loading partition table...");
        flash_binary(bin.part.data, bin.part.size, bin.part.addr);
        ESP_LOGI(TAG, "Loading app...");
        flash_binary(bin.app.data,  bin.app.size,  bin.app.addr);
        ESP_LOGI(TAG, "Done!");
	
	printf("esp_flasher() 4\n");
        esp_loader_reset_target(); // replace this with local custom version
	printf("esp_flasher() 5\n");
        // Delay for skipping the boot message of the targets
        vTaskDelay(500 / portTICK_PERIOD_MS);

    }
}

static const char *get_error_string(const esp_loader_error_t error)
{
    const char *mapping[ESP_LOADER_ERROR_INVALID_RESPONSE + 1] = {
        "NONE", "UNKNOWN", "TIMEOUT", "IMAGE SIZE",
        "INVALID MD5", "INVALID PARAMETER", "INVALID TARGET",
        "UNSUPPORTED CHIP", "UNSUPPORTED FUNCTION", "INVALID RESPONSE"
    };

    assert(error <= ESP_LOADER_ERROR_INVALID_RESPONSE);

    return mapping[error];
}

esp_loader_error_t connect_to_target(uint32_t higher_transmission_rate)
{
    esp_loader_connect_args_t connect_config = ESP_LOADER_CONNECT_DEFAULT();

    esp_loader_error_t err = esp_loader_connect(&connect_config);
    if (err != ESP_LOADER_SUCCESS) {
        printf("Cannot connect to target. Error: %s\n", get_error_string(err));

        if (err == ESP_LOADER_ERROR_TIMEOUT) {
            printf("Check if the host and the target are properly connected.\n");
        } else if (err == ESP_LOADER_ERROR_INVALID_TARGET) {
            printf("You could be using an unsupported chip, or chip revision.\n");
        } else if (err == ESP_LOADER_ERROR_INVALID_RESPONSE) {
            printf("Try lowering the transmission rate or using shorter wires to connect the host and the target.\n");
        }

        return err;
    }
    printf("Connected to target\n");

#if (defined SERIAL_FLASHER_INTERFACE_UART) || (defined SERIAL_FLASHER_INTERFACE_USB)
    if (higher_transmission_rate && esp_loader_get_target() != ESP8266_CHIP) {
        err = esp_loader_change_transmission_rate(higher_transmission_rate);
        if (err == ESP_LOADER_ERROR_UNSUPPORTED_FUNC) {
            printf("ESP8266 does not support change transmission rate command.");
            return err;
        } else if (err != ESP_LOADER_SUCCESS) {
            printf("Unable to change transmission rate on target.");
            return err;
        } else {
            err = loader_port_change_transmission_rate(higher_transmission_rate);
            if (err != ESP_LOADER_SUCCESS) {
                printf("Unable to change transmission rate.");
                return err;
            }
            printf("Transmission rate changed.\n");
        }
    }
#endif /* SERIAL_FLASHER_INTERFACE_UART || SERIAL_FLASHER_INTERFACE_USB */

    return ESP_LOADER_SUCCESS;
}

#if (defined SERIAL_FLASHER_INTERFACE_UART) || (defined SERIAL_FLASHER_INTERFACE_USB)
esp_loader_error_t connect_to_target_with_stub(const uint32_t current_transmission_rate,
        const uint32_t higher_transmission_rate)
{
    esp_loader_connect_args_t connect_config = ESP_LOADER_CONNECT_DEFAULT();

    esp_loader_error_t err = esp_loader_connect_with_stub(&connect_config);
    if (err != ESP_LOADER_SUCCESS) {
        printf("Cannot connect to target. Error: %s\n", get_error_string(err));

        if (err == ESP_LOADER_ERROR_TIMEOUT) {
            printf("Check if the host and the target are properly connected.\n");
        } else if (err == ESP_LOADER_ERROR_INVALID_TARGET) {
            printf("You could be using an unsupported chip, or chip revision.\n");
        } else if (err == ESP_LOADER_ERROR_INVALID_RESPONSE) {
            printf("Try lowering the transmission rate or using shorter wires to connect the host and the target.\n");
        }

