JK1DVP/dvplogger/dvplogger/main/esp32_flasher.c
        return err;
    }
    printf("Connected to target\n");

    if (higher_transmission_rate != current_transmission_rate) {
        err = esp_loader_change_transmission_rate_stub(current_transmission_rate,
                higher_transmission_rate);

        if (err == ESP_LOADER_ERROR_UNSUPPORTED_FUNC) {
            printf("ESP8266 does not support change transmission rate command.");
            return err;
        } else if (err != ESP_LOADER_SUCCESS) {
            printf("Unable to change transmission rate on target.");
            return err;
        } else {
            err = loader_port_change_transmission_rate(higher_transmission_rate);
            if (err != ESP_LOADER_SUCCESS) {
                printf("Unable to change transmission rate.");
                return err;
            }
            printf("Transmission rate changed.\n");
        }
    }

    return ESP_LOADER_SUCCESS;
}

esp_loader_error_t flash_binary(const uint8_t *bin, size_t size, size_t address)
{
    esp_loader_error_t err;
    static uint8_t payload[1024];
    const uint8_t *bin_addr = bin;

    printf("Erasing flash (this may take a while)...\n");
    err = esp_loader_flash_start(address, size, sizeof(payload));
    if (err != ESP_LOADER_SUCCESS) {
        printf("Erasing flash failed with error: %s.\n", get_error_string(err));

        if (err == ESP_LOADER_ERROR_INVALID_PARAM) {
            printf("If using Secure Download Mode, double check that the specified\
                    target flash size is correct.\n");
        }
        return err;
    }
    printf("Start programming\n");

    size_t binary_size = size;
    size_t written = 0;

    while (size > 0) {
        size_t to_read = MIN(size, sizeof(payload));
        memcpy(payload, bin_addr, to_read);

        err = esp_loader_flash_write(payload, to_read);
        if (err != ESP_LOADER_SUCCESS) {
            printf("\nPacket could not be written! Error %s.\n", get_error_string(err));
            return err;
        }

        size -= to_read;
        bin_addr += to_read;
        written += to_read;

        int progress = (int)(((float)written / binary_size) * 100);
        printf("\rProgress: %d %%", progress);
    };

    printf("\nFinished programming\n");

#if MD5_ENABLED
    err = esp_loader_flash_verify();
    if (err == ESP_LOADER_ERROR_UNSUPPORTED_FUNC) {
        printf("ESP8266 does not support flash verify command.");
        return err;
    } else if (err != ESP_LOADER_SUCCESS) {
        printf("MD5 does not match. Error: %s\n", get_error_string(err));
        return err;
    }
    printf("Flash verified\n");
#endif

    return ESP_LOADER_SUCCESS;
}
#endif /* SERIAL_FLASHER_INTERFACE_UART || SERIAL_FLASHER_INTERFACE_USB */

esp_loader_error_t load_ram_binary(const uint8_t *bin)
{
    printf("Start loading\n");
    esp_loader_error_t err;
    const esp_loader_bin_header_t *header = (const esp_loader_bin_header_t *)bin;
    esp_loader_bin_segment_t segments[header->segments];

    // Parse segments
    uint32_t seg;
    uint32_t *cur_seg_pos;
    // ESP8266 does not have extended header
    uint32_t offset = esp_loader_get_target() == ESP8266_CHIP ? BIN_HEADER_SIZE : BIN_HEADER_EXT_SIZE;
    for (seg = 0, cur_seg_pos = (uint32_t *)(&bin[offset]);
            seg < header->segments;
            seg++) {
        segments[seg].addr = *cur_seg_pos++;
        segments[seg].size = *cur_seg_pos++;
        segments[seg].data = (uint8_t *)cur_seg_pos;
        cur_seg_pos += (segments[seg].size) / 4;
    }

    // Download segments
    for (seg = 0; seg < header->segments; seg++) {
        printf("Downloading %"PRIu32" bytes at 0x%08"PRIx32"...\n", segments[seg].size, segments[seg].addr);

        err = esp_loader_mem_start(segments[seg].addr, segments[seg].size, ESP_RAM_BLOCK);
        if (err != ESP_LOADER_SUCCESS) {
            printf("Loading to RAM could not be started. Error: %s.\n", get_error_string(err));

            if (err == ESP_LOADER_ERROR_INVALID_PARAM) {
                printf("Check if the chip has Secure Download Mode enabled.\n");
            }
            return err;
        }

        size_t remain_size = segments[seg].size;
        uint8_t *data_pos = segments[seg].data;
        while (remain_size > 0) {
            size_t data_size = MIN(ESP_RAM_BLOCK, remain_size);
            err = esp_loader_mem_write(data_pos, data_size);
            if (err != ESP_LOADER_SUCCESS) {
                printf("\nPacket could not be written! Error: %s.\n", get_error_string(err));
                return err;
            }
            data_pos += data_size;
            remain_size -= data_size;
        }
    }

    err = esp_loader_mem_finish(header->entrypoint);
    if (err != ESP_LOADER_SUCCESS) {
        printf("\nLoading to RAM finished with error: %s.\n", get_error_string(err));
        return err;
    }
    printf("\nFinished loading\n");

    return ESP_LOADER_SUCCESS;
}


// flash from SD card
#define CHUNK_SIZE 1024  // 一度に読み込むバイト数（1KB）

int flash_bin_file_streaming(const char *filepath, uint32_t flash_address) {
    printf("[FLASHERSD-STAGE 01] enter path=%s address=0x%08" PRIX32 "\n",
           filepath, flash_address);
    fflush(stdout);

    printf("[FLASHERSD-STAGE 02] before sd_fopen\n");
    fflush(stdout);
    SDFileHandle *fp = sd_fopen(filepath, "r");
    printf("[FLASHERSD-STAGE 03] after sd_fopen fp=%p\n", (void *)fp);
    fflush(stdout);

    esp_loader_error_t err;
    if (!fp) {
        printf("[FLASHERSD] file open failed path=%s\n", filepath);
        fflush(stdout);
        return -1;
    }

    printf("[FLASHERSD-STAGE 04] before sd_fsize\n");
    fflush(stdout);
    size_t total_size = sd_fsize(fp);
    printf("[FLASHERSD-STAGE 05] after sd_fsize size=%zu\n", total_size);
    fflush(stdout);

    printf("[FLASHERSD-STAGE 06] before sd_fseek(0)\n");
    fflush(stdout);
    sd_fseek(fp, 0);
    printf("[FLASHERSD-STAGE 07] after sd_fseek(0)\n");
    fflush(stdout);

    printf("[FLASHERSD-STAGE 08] before flash_start address=0x%08" PRIX32
           " size=%zu block=%u\n", flash_address, total_size,
           (unsigned int)CHUNK_SIZE);
    fflush(stdout);
    err = esp_loader_flash_start(flash_address, total_size, CHUNK_SIZE);
    printf("[FLASHERSD-STAGE 09] after flash_start result=%d (%s)\n",
           (int)err, get_error_string(err));
    fflush(stdout);
    if (err != ESP_LOADER_SUCCESS) {
        printf("[FLASHERSD] flash_start failed error=%d (%s)\n",
               (int)err, get_error_string(err));
        fflush(stdout);
        if (err == ESP_LOADER_ERROR_INVALID_PARAM) {
            printf("If using Secure Download Mode, double check that the specified target flash size is correct.\n");
            fflush(stdout);
        }
        sd_fclose(fp);
        return err;
    }

    static uint8_t buffer[CHUNK_SIZE];
    size_t offset = 0;
    unsigned int block_no = 0;

    while (!sd_feof(fp) && offset < total_size) {
        size_t to_read = CHUNK_SIZE;
        if (offset + to_read > total_size) {
            to_read = total_size - offset;
        }

        if (block_no == 0) {
            printf("[FLASHERSD-STAGE 10] before first sd_fread offset=%zu len=%zu\n",
                   offset, to_read);
            fflush(stdout);
        }
        size_t read_bytes = sd_fread(buffer, to_read, fp);
        if (block_no == 0) {
            printf("[FLASHERSD-STAGE 11] after first sd_fread read=%zu\n",
                   read_bytes);
            fflush(stdout);
        }
        if (read_bytes != to_read) {
            printf("[FLASHERSD] file read error block=%u offset=%zu requested=%zu read=%zu\n",
                   block_no, offset, to_read, read_bytes);
            fflush(stdout);
            break;
        }

        if (block_no == 0) {
            printf("[FLASHERSD-STAGE 12] before first flash_write len=%zu\n",
                   read_bytes);
            fflush(stdout);
        }
        err = esp_loader_flash_write(buffer, read_bytes);
        if (block_no == 0) {
            printf("[FLASHERSD-STAGE 13] after first flash_write result=%d (%s)\n",
                   (int)err, get_error_string(err));
            fflush(stdout);
        }
        if (err != ESP_LOADER_SUCCESS) {
            printf("[FLASHERSD] flash_write failed block=%u offset=%zu len=%zu error=%d (%s)\n",
                   block_no, offset, read_bytes, (int)err, get_error_string(err));
            fflush(stdout);
            sd_fclose(fp);
            return err;
        }

        offset += read_bytes;
        block_no++;

        if ((offset % (16 * 1024)) == 0 || offset == total_size) {
            printf("[FLASHERSD-STAGE 20] progress block=%u offset=%zu/%zu (%u%%)\n",
                   block_no, offset, total_size,
                   total_size ? (unsigned int)((offset * 100U) / total_size) : 100U);
            fflush(stdout);
        }
    }

    printf("[FLASHERSD-STAGE 30] before sd_fclose offset=%zu/%zu\n",
           offset, total_size);
    fflush(stdout);
    sd_fclose(fp);
    printf("[FLASHERSD-STAGE 31] after sd_fclose\n");
    fflush(stdout);
    printf("[FLASHERSD] file complete path=%s written=%zu/%zu\n",
           filepath, offset, total_size);
    fflush(stdout);
    return 0;
}


#define CHUNK_SIZE 1024

void flash_file_to_partition(const char *filepath) {
    const esp_partition_t *partition = esp_partition_find_first(
        ESP_PARTITION_TYPE_DATA, 0x40, "mydata");
    
    if (!partition) {
        printf("Partition not found!\n");
        return;
    }

    FILE *fp = fopen(filepath, "rb");
    if (!fp) {
        printf("File open failed\n");
        return;
    }

    uint8_t buffer[CHUNK_SIZE];
    size_t offset = 0;

    while (!feof(fp)) {
        size_t read_bytes = fread(buffer, 1, CHUNK_SIZE, fp);
        if (read_bytes <= 0) break;

        esp_err_t err = esp_partition_write(partition, offset, buffer, read_bytes);
        if (err != ESP_OK) {
            printf("Write failed at offset %zu: %s\n", offset, esp_err_to_name(err));
            break;
        }

        offset += read_bytes;
    }

    fclose(fp);
    printf("Write complete.\n");
}
